# QUESTION 1

In [1]:
import selenium
from selenium import webdriver
import pandas as pd
import warnings
warnings.filterwarnings("ignore")
from selenium.webdriver.common.by import By
import time

In [2]:
from selenium.webdriver.common.keys import Keys
from selenium.common.exceptions import NoSuchElementException 
from selenium.webdriver.support.ui import WebDriverWait

In [5]:
driver = webdriver.Chrome(r"chromedriver.exe")

In [6]:
driver.get("https://www.naukri.com/")

In [8]:
designation = driver.find_element(By.CLASS_NAME, "suggestor-input")
designation.send_keys("Data Analyst")

In [9]:
location = driver.find_element(By.XPATH, "/html/body/div[1]/div[7]/div/div/div[5]/div/div/div/div[1]/div/input")
location.send_keys("Banglore")

In [10]:
search = driver.find_element(By.CLASS_NAME,"qsbSubmit")
search.click()

In [11]:
job_title = []
job_location = []
company_name = []
exp_required = []

In [14]:
title = driver.find_elements(By.XPATH, '//a[@Class= "title ellipsis"]')

for i in title[0:10]:
    a = i.text
    job_title.append(a)

In [15]:
len(job_title)

10

In [17]:
location = driver.find_elements(By.XPATH, '//span[@Class="ellipsis fleft locWdth"]')

for i in location[0:10]:
    b = i.text
    job_location.append(b)
    
company = driver.find_elements(By.XPATH, '//a[@Class= "subTitle ellipsis fleft"]')

for i in company[0:10]:
    c = i.text
    company_name.append(c)
    
exp = driver.find_elements(By.XPATH, '//span[@Class= "ellipsis fleft expwdth"]')

for i in exp[0:10]:
    d = i.text
    exp_required.append(d)

In [20]:
print(len(job_title), len(job_location), len(company_name), len(exp_required))

10 10 10 10

In [22]:
df = pd.DataFrame({'TITLE':job_title,'LOCATION':job_location, 'COMPANY NAME':company_name, 'EXPERIENCE REQUIRED':exp_required})

In [23]:
df

,TITLE,LOCATION,COMPANY NAME,EXPERIENCE REQUIRED
0,Data Analyst,Bangalore/Bengaluru,Cynosure Corporate Solutions,2-7 Yrs
1,Data Analyst III,Bangalore/Bengaluru,Walmart,3-7 Yrs
2,Data Analyst III,Bangalore/Bengaluru,Walmart,3-7 Yrs
3,Compliance Rule Writer/Data Analyst,Bangalore/Bengaluru,Paypal,5-8 Yrs
4,Data Analyst || Bangalore || Male/ Female || 1...,Bangalore/Bengaluru,TeamLease,1-5 Yrs
5,Data Analyst,Bangalore/Bengaluru,Ingersoll Rand,3-6 Yrs
6,Data Analyst - EdTech,Bangalore/Bengaluru,Talentstack,2-6 Yrs
7,Data Analyst,Bangalore/Bengaluru,Unusual Hire,1-4 Yrs
8,Data Engineer/Data Analyst,"Hybrid - Kolkata, Hyderabad/Secunderabad, Pune...",Tech Mahindra,6-11 Yrs
9,Data Analyst - Contractual,Bangalore/Bengaluru,Search Advisers Services Guj,2-3 Yrs

# QUESTION 2

In [28]:
driver = webdriver.Chrome(r"chromedriver.exe")

In [29]:
driver.get("https://www.naukri.com/")

In [30]:
designation = driver.find_element(By.CLASS_NAME, "suggestor-input")
designation.send_keys("Data Scientist")

In [31]:
location = driver.find_element(By.XPATH, "/html/body/div[1]/div[7]/div/div/div[5]/div/div/div/div[1]/div/input")
location.send_keys("Banglore")

In [32]:
search = driver.find_element(By.CLASS_NAME,"qsbSubmit")
search.click()

In [33]:
job_title = []
job_location = []
company_name = []
exp_required = []

In [34]:
title = driver.find_elements(By.XPATH, '//a[@Class= "title ellipsis"]')

for i in title[0:10]:
    a = i.text
    job_title.append(a)

location = driver.find_elements(By.XPATH, '//span[@Class="ellipsis fleft locWdth"]')

for i in location[0:10]:
    b = i.text
    job_location.append(b)
    
company = driver.find_elements(By.XPATH, '//a[@Class= "subTitle ellipsis fleft"]')

for i in company[0:10]:
    c = i.text
    company_name.append(c)
    
exp = driver.find_elements(By.XPATH, '//span[@Class= "ellipsis fleft expwdth"]')

for i in exp[0:10]:
    d = i.text
    exp_required.append(d)

In [35]:
print(len(job_title), len(job_location), len(company_name), len(exp_required))

10 10 10 10

In [36]:
df2 = pd.DataFrame({'TITLE':job_title,'LOCATION':job_location, 'COMPANY NAME':company_name, 'EXPERIENCE REQUIRED':exp_required})

In [37]:
df2

,TITLE,LOCATION,COMPANY NAME,EXPERIENCE REQUIRED
0,Data Science Professional - IBM SPSS Statistic...,"Noida, Mumbai, Pune, Chennai, Bangalore/Bengaluru",Hexaware Technologies,5-8 Yrs
1,Data Science Specialist,"Kolkata, Mumbai, Hyderabad/Secunderabad, Pune,...",Accenture,2-4 Yrs
2,Analystics & Modeling Specialist,"Kolkata, Mumbai, Hyderabad/Secunderabad, Pune,...",Accenture,6-8 Yrs
3,Senior data scientist,"Mumbai, Pune, Chennai, Gurgaon/Gurugram, Banga...",Fractal Analytics,4-8 Yrs
4,Data Scientist_NLP,"Mumbai, Pune, Chennai, Gurgaon/Gurugram, Banga...",Fractal Analytics,5-11 Yrs
5,Data Scientist,"Mumbai, Pune, Chennai, Gurgaon/Gurugram, Banga...",Fractal Analytics,3-7 Yrs
6,Machine Learning (AI) Architect,"Kolkata, Mumbai, New Delhi, Hyderabad/Secunder...",Persistent,5-12 Yrs
7,Manager - Innovations Hub - Machine Learning,"Mumbai, Hyderabad/Secunderabad, Bangalore/Beng...",PwC,7-9 Yrs
8,Data Scientist,"Temp. WFH - Kochi/Cochin, Kolkata, Hyderabad/S...",Cognizant,6-10 Yrs
9,Staff Data Scientist,"Mumbai, Bangalore/Bengaluru",Baker Hughes,10-12 Yrs

# QUESTION 3

In [99]:
driver = webdriver.Chrome(r"chromedriver.exe")

In [100]:
driver.get("https://www.naukri.com/")

In [101]:
designation = driver.find_element(By.CLASS_NAME, "suggestor-input")
designation.send_keys("Data Scientist")

In [102]:
search = driver.find_element(By.CLASS_NAME,"qsbSubmit")
search.click()

In [104]:
salary_tab = driver.find_element(By.XPATH, '//i[@Class="fleft naukicon naukicon-checkbox"]')
salary_tab.click()

In [95]:
location_tag = driver.find_element(By.CLASS_NAME,"chkLbl")

In [98]:
location_tag.text

'Data Scientist\n(1013)'

In [105]:
job_title = []
job_location = []
company_name = []
exp_required = []

In [106]:
title = driver.find_elements(By.XPATH, '//a[@Class= "title ellipsis"]')

for i in title[0:10]:
    a = i.text
    job_title.append(a)

location = driver.find_elements(By.XPATH, '//span[@Class="ellipsis fleft locWdth"]')

for i in location[0:10]:
    b = i.text
    job_location.append(b)
    
company = driver.find_elements(By.XPATH, '//a[@Class= "subTitle ellipsis fleft"]')

for i in company[0:10]:
    c = i.text
    company_name.append(c)
    
exp = driver.find_elements(By.XPATH, '//span[@Class= "ellipsis fleft expwdth"]')

for i in exp[0:10]:
    d = i.text
    exp_required.append(d)

In [107]:
df3 = pd.DataFrame({'TITLE':job_title,'LOCATION':job_location, 'COMPANY NAME':company_name, 'EXPERIENCE REQUIRED':exp_required})

In [108]:
df3

,TITLE,LOCATION,COMPANY NAME,EXPERIENCE REQUIRED
0,Java Backend Engineer - Spring Boot / Microser...,"Pune, Kolkata, Mumbai, Hyderabad/Secunderabad,...",Patch Infotech,1-6 Yrs
1,Java Backend Engineer - Spring Boot/Microservi...,"Pune, Kolkata, Mumbai, Hyderabad/Secunderabad,...",Patch Infotech,1-6 Yrs
2,Data Science Professional - IBM SPSS Statistic...,"Pune, Noida, Mumbai, Chennai, Bangalore/Bengaluru",Hexaware Technologies,5-8 Yrs
3,Java with Springboot/Microservices & Banking D...,"Pune, Chennai, Bangalore/Bengaluru, Mumbai (Al...",Oracle,5-10 Yrs
4,Senior Software Engineer,"Pune, Kolkata, Mumbai, New Delhi, Hyderabad/Se...",Browserstack,3-6 Yrs
5,Capgemini _We Are Hiring For Java Backend deve...,"Hybrid - Pune, Kolkata, Hyderabad/Secunderabad...",Capgemini,6-11 Yrs
6,Data Science Specialist,"Pune, Kolkata, Mumbai, Hyderabad/Secunderabad,...",Accenture,2-4 Yrs
7,Analystics & Modeling Specialist,"Pune, Kolkata, Mumbai, Hyderabad/Secunderabad,...",Accenture,6-8 Yrs
8,"Java, Spring, Microservices Developer","Pune, Bangalore/Bengaluru",VMware,8-12 Yrs
9,Senior data scientist,"Pune, Mumbai, Chennai, Gurgaon/Gurugram, Banga...",Fractal Analytics,4-8 Yrs

# QUESTION 4

In [14]:
driver = webdriver.Chrome(r"chromedriver.exe")

In [15]:
driver.get("https://www.flipkart.com/")

In [16]:
designation = driver.find_element(By.CLASS_NAME, "_3704LK")
designation.send_keys("Sunglasses")

In [18]:
search = driver.find_element(By.CLASS_NAME,"L0Z3Pu")
search.click()

In [19]:
Brand = []
product_description = []
Price = []

In [20]:
start=0
end=3
for page in range(start,end):
    brands=driver.find_elements(By.XPATH,"//div[@class='_2WkVRV']")
    for i in brands[0:100]:
        Brand.append(i.text)
    Product_desc=driver.find_elements(By.XPATH,"//a[@class='IRpwTa']")
    for i in Product_desc[0:100]:
        product_description.append(i.text)    
    prices=driver.find_elements(By.XPATH,"//div[@class='_30jeq3']")
    for i in prices[0:100]:
        Price.append(i.text)
    next_button=driver.find_elements(By.XPATH,"//a[@class='_1LKTO3']")

In [21]:
print(len(Brand), len(product_description), len(Price))

120 117 120

In [ ]:
#QUESTION 5

In [22]:
driver.get("https://www.flipkart.com/apple-iphone-11-black-64-gb-includes-earpods-power-adapter/product-reviews/itm0f37c2240b217?pid=MOBFKCTSVZAXUHGR&lid=LSTMOBFKCTSVZAXUHGREPBFGI&marketplace=FLIPKART")

In [23]:
urls=[]
short_review=[]
complete_review=[]
stars=[]

In [24]:
url_1 = driver.find_elements(By.XPATH,"//a[@class='ge-49M _2Kfbh8']")
for i in url_1:
    urls.append(i.get_attribute('href'))
url_2 = driver.find_elements(By.XPATH,"//a[@class='ge-49M']")
for i in url_2:
    urls.append(i.get_attribute('href'))
time.sleep(4)


for i in urls:
    driver.get(i)
    for a in driver.find_elements(By.XPATH,"//div[@class='col _2wzgFH K0kLPL']/div[1]/div[1]"):
        stars.append(a.text)
    for b in driver.find_elements(By.XPATH,"//p[@class='_2-N8zT']"):
        short_review.append(b.text)
    for c in driver.find_elements(By.XPATH,"//div[@class='t-ZTKy']/div/div"):
        complete_review.append(c.text)

In [25]:
print(len(stars),len(short_review),len(complete_review))

100 100 100

In [26]:
df5=pd.DataFrame({'Rating':stars,'Review_summary':short_review,'Full_summary':complete_review})
df5

,Rating,Review_summary,Full_summary
0,5,Simply awesome,Really satisfied with the Product I received.....
1,5,Perfect product!,Amazing phone with great cameras and better ba...
2,5,Best in the market!,Great iPhone very snappy experience as apple k...
3,4,Value-for-money,I'm Really happy with the product\nDelivery wa...
4,5,Highly recommended,It's my first time to use iOS phone and I am l...
...,...,...,...
95,5,Wonderful,Its good.. a little heavy on my pinky but its ...
96,5,Terrific,Simply Awesome\n\nI have upgraded from iPhone ...
97,5,Best in the market!,Damn this phone is a blast . Upgraded from and...
98,5,Perfect product!,Worth the money’ starting first from its perfo...
99,1,Absolute rubbish!,Worst product delivered by Flipkart\nAfter 10d...

# QUESTION 6

In [34]:
driver.get("https://www.flipkart.com/")

In [35]:
search = driver.find_element(By.CLASS_NAME, "_3704LK")
search.send_keys("sneakers")

In [36]:
searchbtn=driver.find_element(By.CLASS_NAME,"L0Z3Pu")
searchbtn.click()

In [37]:
brand=[]
description=[]
price=[]

In [38]:
start=0
end=3
for page in range(start,end):
    brands=driver.find_elements(By.CLASS_NAME,'_2WkVRV')
    for i in brands[0:100]:
        brand.append(i.text)
    prices=driver.find_elements(By.XPATH,"//div[@class='_30jeq3']")
    for i in prices[0:100]:
        price.append(i.text)
    descriptions=driver.find_elements(By.XPATH,'//a[@class="IRpwTa" or @class="IRpwTa _2-ICcC"]')
    for i in descriptions[0:100]:
        description.append(i.text)
        
    nxt_button=driver.find_elements(By.XPATH,"//a[@class='_1LKTO3']")

In [39]:
print(len(brand),len(description),len(price))

120 120 120

In [40]:
df6=pd.DataFrame({'Brand':brand,'Prod_desc':description,'Price':price})
df6

             Brand                                          Prod_desc   Price
0      New Balance                               500 Sneakers For Men  ₹4,924
1         RapidBox                                   Sneakers For Men    ₹571
2              SFR  2006 Trenddy Fashion Sporty Casuals Sneakers R...    ₹299
3           Kraasa                                 Sneakers For Women    ₹299
4            BIRDE      Combo Pack Of 2 Casual Shoes Sneakers For Men    ₹499
..             ...                                                ...     ...
115          BIRDE  Premium Sports Shoes For Men Pack Of 2 Sneaker...    ₹499
116          Sparx                            SM-784 Sneakers For Men    ₹969
117       Aqualite  Running Shoes,Sports Shoes for Women|Memory Fo...    ₹599
118  WHITE WALKERS  Stylish & Trending Outdoor Walking Comfortable...    ₹449
119  WHITE WALKERS  Stylish & Trending Outdoor Walking Comfortable...    ₹449

[120 rows x 3 columns]

# QUESTION 7

In [3]:
driver = webdriver.Chrome(r"chromedriver.exe")

In [4]:
driver.get("https://www.amazon.in/")

In [5]:
search=driver.find_element(By.XPATH,"//div[@class='nav-search-field ']//input")
search.send_keys('Laptop')

searchbtn=driver.find_element(By.XPATH,"/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[3]/div/span/input")
searchbtn.click()

In [6]:
ci7=driver.find_element(By.XPATH,"/html/body/div[1]/div[2]/div[1]/div[2]/div/div[3]/span/div[1]/div/div/div[5]/ul[7]/li[10]/span/a/div/label/i")
ci7.click()

In [7]:
title=[]
price=[]
rate=[]
rating=[]

In [8]:
TITLE =driver.find_elements(By.XPATH,"//h2[@class='a-size-mini a-spacing-none a-color-base s-line-clamp-2']")
for i in TITLE[0:10]:
    title.append(i.text) 
        
PRICE =driver.find_elements(By.XPATH,'//span[@class="a-price-whole"]')
for i in PRICE[0:10]:
    price.append(i.text) 
    
RATE =driver.find_elements(By.XPATH,"//div[@class='a-row a-size-small']/span")
for i in RATE[0:10]:
    rate.append(i.get_attribute("aria-label"))

In [9]:
print(len(title), len(price), len(rate))

10 10 10

In [10]:
df7=pd.DataFrame({'Title':title,'Price':price,'Ratings':rate})
df7

,Title,Price,Ratings
0,HP Victus Gaming Latest 12th Gen Intel Core i7...,"82,990",4.3 out of 5 stars
1,Samsung Galaxy Book2 (NP750) Intel 12th Gen co...,"76,990",119
2,"ASUS TUF Gaming F15 (2022), 15.6""(39.62 cms) F...","94,990",4.1 out of 5 stars
3,HP Pavilion 14 12th Gen Intel Core i7 16GB SDR...,"83,990",103
4,"ASUS TUF Dash F15, Intel Core i7-12650H 12th G...","99,990",4.4 out of 5 stars
5,"ASUS VivoBook K15 OLED (2021), 15.6-inch FHD O...","69,990",71
6,Lenovo IdeaPad Slim 5 Intel Core i7 12th Gen 1...,"31,592",4.3 out of 5 stars
7,(Renewed) HP 840g3 Elitebook 14 Inch Screen La...,"99,990",51
8,"Dell G15 5520 Windows 11 Gaming Laptop, Intel ...","1,50,180",4.0 out of 5 stars
9,HP Omen 12th Gen Intel Core i7-12700H 16.1 inc...,"1,66,399",2